RobertWeber1/stm32_cmake/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */


#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif


#include "stm32f2xx_hal.h"


void Error_Handler(void);


#define USER_Btn_Pin                GPIO_PIN_13
#define USER_Btn_GPIO_Port          GPIOC

#define LedRed_Pin                  GPIO_PIN_14
#define LedRed_GPIO_Port            GPIOB
#define LedGreen_Pin                GPIO_PIN_0
#define LedGreen_GPIO_Port          GPIOB
#define LedBlue_Pin                 GPIO_PIN_7
#define LedBlue_GPIO_Port           GPIOB

#define MCO_Pin                     GPIO_PIN_0
#define MCO_GPIO_Port               GPIOH

#define RMII_MDC_Pin                GPIO_PIN_1
#define RMII_MDC_GPIO_Port          GPIOC
#define RMII_REF_CLK_Pin            GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port      GPIOA
#define RMII_MDIO_Pin               GPIO_PIN_2
#define RMII_MDIO_GPIO_Port         GPIOA
#define RMII_CRS_DV_Pin             GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port       GPIOA
#define RMII_RXD0_Pin               GPIO_PIN_4
#define RMII_RXD0_GPIO_Port         GPIOC
#define RMII_RXD1_Pin               GPIO_PIN_5
#define RMII_RXD1_GPIO_Port         GPIOC
#define RMII_TXD1_Pin               GPIO_PIN_13
#define RMII_TXD1_GPIO_Port         GPIOB
#define RMII_TX_EN_Pin              GPIO_PIN_11
#define RMII_TX_EN_GPIO_Port        GPIOG
#define RMII_TXD0_Pin               GPIO_PIN_13
#define RMII_TXD0_GPIO_Port         GPIOG

#define STLK_RX_Pin                 GPIO_PIN_8
#define STLK_RX_GPIO_Port           GPIOD
#define STLK_TX_Pin                 GPIO_PIN_9
#define STLK_TX_GPIO_Port           GPIOD

#define USB_PowerSwitchOn_Pin       GPIO_PIN_6
#define USB_PowerSwitchOn_GPIO_Port GPIOG
#define USB_OverCurrent_Pin         GPIO_PIN_7
#define USB_OverCurrent_GPIO_Port   GPIOG
#define USB_SOF_Pin                 GPIO_PIN_8
#define USB_SOF_GPIO_Port           GPIOA
#define USB_VBUS_Pin                GPIO_PIN_9
#define USB_VBUS_GPIO_Port          GPIOA
#define USB_ID_Pin                  GPIO_PIN_10
#define USB_ID_GPIO_Port            GPIOA
#define USB_DM_Pin                  GPIO_PIN_11
#define USB_DM_GPIO_Port            GPIOA
#define USB_DP_Pin                  GPIO_PIN_12
#define USB_DP_GPIO_Port            GPIOA

#define TMS_Pin                     GPIO_PIN_13
#define TMS_GPIO_Port               GPIOA

#define TCK_Pin                     GPIO_PIN_14
#define TCK_GPIO_Port               GPIOA

#define SWO_Pin                     GPIO_PIN_3
#define SWO_GPIO_Port               GPIOB


int fputc(int ch, FILE *);

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
